package com.common.district.common;

/**
 * @author sk
 * @date 2019-07-26
 * @desc 常量类
 */
public class Constant {

    /*********************************************************************
     *****************************   日期相关   *****************************
     *********************************************************************
     */
    /**
     * 默认时间格式
     */
    public static final String DEFAULT_DATETIME_FORMAT = "yyyy-MM-dd HH:mm:ss";

    /*********************************************************************
     *****************************   分页相关   *****************************
     *********************************************************************
     */
	 /*默认分页大小*/
    public static final Integer DEFAULT_PAGE_SIZE = 10;

    /**
     * 限制显示条数的最大值
     */
    public static final Integer MAX_PAGE_SIZE = 200;


    /*********************************************************************
     *****************************   点位相关   *****************************
     *********************************************************************
     */
    // 从redis中根据key获取序列号
    public static final String POSITION_CODE_KEY="DWBH";
    /*********************************************************************
     *****************************   删除相关   *****************************
     *********************************************************************
     */
    /*********************************************************************
     *****************************   字典相关   *****************************
     *********************************************************************
     */
    public static final String CONTRACT_TYPE="HTLX";
    public static final String CONTRACT_STATUS="HTZT";
    public static final String VIOLATE_TYPE="WYJSKFS";
    /**
     * 已删除
     */
    public static final Integer DELETE_TRUE = 1;
    /**
     * 未删除
     */
    public static final Integer DELETE_FALSE = 0;

    /*********************************************************************
     *****************************   DB默认日期   *****************************
     *********************************************************************
     */
    /**
     * 默认时间
     */
    public static final String DB_DEFAULT_DATE_TIME = "3000-01-01 00:00:00";

    /**
     * 默认GMT时间
     * 东八区，少8个小时，3000直接转换会报错
     */
    public static final String DB_DEFAULT_GMT_DATE_TIME = "2999-12-31 16:00:00";
}
